{
  "title": "Act1: Introduction to Word Embeddings",
  "act-description":
    "In this act, we will introduce the concept of word embeddings, explain why they are important, and provide a simple example.",
  "num-of-scenes": 3,
  "scenes": [
    {
      "title": "Scene 1: What are Word Embeddings?",
      "scene-visual": [
        "A blackboard with the words 'Word Embeddings' written on it. A hand draws a series of dots and lines, representing words and their relationships."
      ],
      "scene-narration": [
        "Imagine you're trying to teach a computer to understand language. How would you represent words in a way that a machine could understand? This is where word embeddings come in. Word embeddings are a type of word representation that allows words with similar meaning to have a similar representation."
      ]
    },
    {
      "title": "Scene 2: Why are Word Embeddings Important?",
      "scene-visual": [
        "A computer screen showing a text analysis program. The program highlights words with similar meanings in the same color."
      ],
      "scene-narration": [
        "Word embeddings are crucial in natural language processing tasks such as sentiment analysis, text classification, and machine translation. They allow machines to understand the semantic relationships between words, making it possible for them to understand and generate human-like text."
      ]
    },
    {
      "title": "Scene 3: A Simple Example of Word Embeddings",
      "scene-visual": [
        "A 3D graph showing a series of dots, each representing a word. Words with similar meanings are grouped together."
      ],
      "scene-narration": [
        "Let's take a simple example. The words 'king', 'queen', 'man', and 'woman' might be represented as points in a space. The relationship between these words can be captured by the distances and directions between these points. For instance, the direction and distance from 'man' to 'king' might be similar to the direction and distance from 'woman' to 'queen'."
      ]
    }
  ]
}
